"espk" = "Apple speaker port";
"ispk" = "Built-in";
"emic" = "Microphone port";
"imic" = "Built-in";
"hdpn" = "Headphone port";
"lini" = "Audio line-in port";
"lino" = "Audio line-out port";
"spdi" = "Optical digital-in port";
"spdo" = "Optical digital-out port";
"pci " = "PCI card";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "Network device";
"blue" = "Bluetooth";
"bluh" = "Bluetooth Headphones";
"blus" = "Bluetooth Headset";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
